app/views/messages/_message.html.erb

  <font color="rrggbb"><br>(From:<%= message.nickname %>=>To:<%= message.receiver %>)</font>
  @<%= message.body %>::<%= message.created_at %>
---
INSERT INTO "messages" ("body", "nickname", "receiver", "created_at", "updated_at") VALUES ('Message23~', 'scott10', 'public', '2011-04-22 22:26:52.565520', '2011-04-22 22:26:52.706145')