app/controllers/messages_controller.rb

SELECT "users".* FROM "users" WHERE "users"."nickname" = 'scott10' LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."nickname" = 'aaa' AND "messages"."receiver" IN ('aaa', 'public') ORDER BY created_at DESC
SELECT "seats".* FROM "seats" ORDER BY seatno ASC
---
  def index
    @users = User.where(:nickname => session[:user_nickname]).first
    @message = Message.new
    @messages = Message.where(:receiver => [session[:user_nickname], 'public']).all(:order => 'created_at ASC')
    @seats = Seat.all(:order => 'seatno ASC')

SELECT "messages".* FROM "messages" WHERE "messages"."id" = 1 LIMIT 1
---
  def edit
    @message = Message.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."nickname" = 'scott10' LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."receiver" IN ('scott10', 'public') ORDER BY messages.id DESC LIMIT 1
DELETE FROM "messages" WHERE "messages"."id" = 23
INSERT INTO "messages" ("body", "nickname", "receiver", "created_at", "updated_at") VALUES ('Hello~ ', 'aaa', NULL, '2011-03-29 23:51:56.328125', '2011-03-29 23:51:56.359375')
---
  def create
    txt = params[:message][:body]
    recver = params[:message][:receiver]
    @users = User.where(:nickname => session[:user_nickname]).first
    @message = Message.new(:nickname => session[:user_nickname], :body => txt,
                           :receiver => recver, :created_at => Time.now)

    if ((Message.where(:receiver => [session[:user_nickname], 'public']).all.count) > 4)
        @message2 = Message.where(:receiver => [session[:user_nickname], 'public']).find(:first)
        @message2.destroy
     end

    respond_to do |format|
      if @message.save

SELECT "messages".* FROM "messages" WHERE "messages"."id" = 63 LIMIT 1
DELETE FROM "messages" WHERE "messages"."id" = 63
---
  def destroy
    @message = Message.find(params[:id])
    @message.destroy