app/controllers/seats_controller.rb

SELECT "seats".* FROM "seats" ORDER BY created_at ASC
SELECT "users".* FROM "users" WHERE "users"."nickname" = 'scott10' LIMIT 1
---
  def index
    @seats = Seat.all(:order => 'seatno ASC')
    @users = User.where(:nickname => session[:user_nickname]).first

SELECT "seats".* FROM "seats" WHERE "seats"."id" = 1 LIMIT 1
---
  def show
   @seat = Seat.find(params[:id])

SELECT "seats".* FROM "seats" WHERE "seats"."id" = 1 LIMIT 1
---
  def edit
    @seat = Seat.find(params[:id])

INSERT INTO "seats" ("seatno", "nickname", "created_at", "updated_at") VALUES (1, 'empty', '2011-03-29 18:43:10.406250', '2011-03-29 18:43:10.406250')
---
  def create

    @seat = Seat.new(params[:seat])

    respond_to do |format|
      if @seat.save

SELECT "users".* FROM "users" WHERE "users"."nickname" = 'scott10' LIMIT 1
SELECT "seats".* FROM "seats" WHERE "seats"."id" = 1 LIMIT 1
SELECT "seats".* FROM "seats" WHERE "seats"."nickname" = 'scott10' LIMIT 1
UPDATE "seats" SET "nickname" = 'scott10', "updated_at" = '2011-03-29 18:47:38.000000' WHERE "seats"."id" = 1
---
  def update
    @users = User.where(:nickname => session[:user_nickname]).first
    @seat = Seat.find(params[:id])

    if @users
      txt = params[:seat][:seatno]
    else
      txt = params[:seat]
    end

    @seat2 = Seat.where(:nickname => session[:user_nickname]).first
    if @seat2
      @seat2.update_attributes(:nickname => 'empty')