app/controllers/sessions_controller.rb

  def destroy
    @seat2 = Seat.where(:nickname => session[:user_nickname]).first
    if @seat2
       @seat2.update_attributes(:nickname => 'empty')
---
SELECT "seats".* FROM "seats" WHERE "seats"."nickname" = 'scott10' LIMIT 1
UPDATE "seats" SET "nickname" = 'empty', "updated_at" = '2011-03-29 18:47:53.078125' WHERE "seats"."id" = 2